app/views/shifts/show.html.erb


    <% if @shift.visit_logs.any? %>
---
SELECT 1 AS one FROM "visit_logs" WHERE "visit_logs"."shift_id" = ? LIMIT ?  [["shift_id", 1], ["LIMIT", 1]]

        <ul class="divide-y">
          <% @shift.visit_logs.order(timestamp: :desc).each do |log| %>
---
SELECT "visit_logs".* FROM "visit_logs" WHERE "visit_logs"."shift_id" = ? ORDER BY "visit_logs"."timestamp" DESC  [["shift_id", 1]]