app/controllers/shifts_controller.rb

  def show
    @caregiver = Caregiver.first # Hardcoded for simplicity
    @shift = @caregiver.shifts.first # Assuming one shift for demo
---
SELECT "caregivers".* FROM "caregivers" ORDER BY "caregivers"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "shifts".* FROM "shifts" WHERE "shifts"."caregiver_id" = ? ORDER BY "shifts"."id" ASC LIMIT ?  [["caregiver_id", 1], ["LIMIT", 1]]

  def start_visit
    @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def end_visit
    @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]