app/models/shift.rb

  def start_visit(latitude, longitude)
    return false if started?

    visit_logs.create(
      event_type: 'start',
      timestamp: Time.current,
      latitude: latitude,
      longitude: longitude
    )
---
INSERT INTO "visit_logs" ("event_type", "timestamp", "latitude", "longitude", "shift_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"